src/Reports/ОтчетПоСкидкамНаценкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ОтчетПоСкидкамНаценкам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппироватьПоПериоду</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассивСмен</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровыватьПоДокументам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантФормирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДиаграммы</Name>
					<Type>
						<v8:Type>v8ui:ChartType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьДиаграмму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыводаДиаграммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>мЧислоКогдаВПродаже</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийВидНастройки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/Reports/ОтчетПоСкидкамНаценкам/Forms/ФормаОтчета/module.bsl
Перем ИмяОбъекта;
Перем НастройкиПереданы Экспорт;          // если флаг установлен, тогда восстановление настроек при открытии не происходит.

////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Восстанавливает настройки отчета
//
// Параметры:
//	Значение - восстановленное значение настройки
//
Процедура ВосстановитьНастройку(Значение) Экспорт

	ВосстанавливаемоеЗначение = Значение.Получить();
		
	Если ВосстанавливаемоеЗначение <> Неопределено Тогда
		ФормированиеОтчетов.ВосстановитьНастройкуОтчета(ЭтотОбъект, ВосстанавливаемоеЗначение);
	КонецЕсли;
		
КонецПроцедуры

// Установка настроек по умолчанию
//
Процедура УстановитьПараметрыПоУмолчанию()
	
	СхемаКомпоновкиДанных.Параметры.ДатаС.Значение = Дата("00010101");
	СхемаКомпоновкиДанных.Параметры.ДатаПо.Значение = Дата("00010101");
	СхемаКомпоновкиДанных.Параметры.МассивСмен.Значение = Неопределено;
	СхемаКомпоновкиДанных.Параметры.ПараметрДата.Значение = Истина;
	КраткийВидНастройки = Истина;
	
КонецПроцедуры

////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события ПриОткрытии.
//
Процедура ПриОткрытии()
	
	// Добавим кнопку сохранения списка клиентов в буфер
//	Рассылки.ДобавитьКнопкуВФормеОтчета(ЭлементыФормы);
	
	Если НЕ ЗначениеЗаполнено(мЧислоКогдаВПродаже) Тогда
		мЧислоКогдаВПродаже = 0;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ВидПериода) Тогда
		ВидПериода = "Смена";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВариантФормирования) Тогда
		ВариантФормирования = "Сводный отчет";
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(РасшифровыватьПоДокументам) Тогда
		РасшифровыватьПоДокументам = Ложь;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ДатаС) И Не ЗначениеЗаполнено(ДатаПо) И Не ЗначениеЗаполнено(МассивСмен) Тогда 
		ДатаС = НачалоКвартала(ТекущаяДата());
		ДатаПо = ТекущаяДата();
		
	КонецЕсли;	
	Период = ПредставлениеПериода(ДатаС,ДатаПо);
	
	Если НЕ НастройкиПереданы Тогда	
		ВосстанавливаемоеЗначение = ФормированиеОтчетов.ВосстановитьПриОткрытииОбр(ИмяОбъекта);
	Иначе
		ВосстанавливаемоеЗначение = Неопределено;
	КонецЕсли;	
	
	Если ВосстанавливаемоеЗначение <> Неопределено Тогда
		ВосстановитьНастройку(ВосстанавливаемоеЗначение);
	Иначе
		УстановитьПараметрыПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

// Обработчик формирования отчета
//
Процедура ДействияФормыСформировать(Кнопка) 
	
	СформироватьОтчет(ЭлементыФормы.Результат,,,ЭлементыФормы);
	
КонецПроцедуры

// Обработчик расшифровки.
//
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормированиеОтчетов.РасшифровкаОтчетов(ЭтотОбъект, Расшифровка, НастройкиОтчетаНаМоментФормирования);
	
КонецПроцедуры

////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Обработчик  нажатия кнопки Настройка.
//
Процедура ДействияФормыНастройка(Кнопка)
	Форма =  ПолучитьФорму("ФормаНастройки", ЭтаФорма);
	
	Если КраткийВидНастройки = Истина Тогда
		Форма.ЭлементыФормы.ГлавнаяПанель.ТекущаяСтраница = Форма.ЭлементыФормы.ГлавнаяПанель.Страницы.Страница1;
	Иначе
		Форма.ЭлементыФормы.ГлавнаяПанель.ТекущаяСтраница = Форма.ЭлементыФормы.ГлавнаяПанель.Страницы.Страница2;
	КонецЕсли;		
	
	Форма.ОткрытьМодально();
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ФормированиеОтчетов.ПередОткрытиемОтчета(ЭтаФорма);
КонецПроцедуры

// задается программно
Процедура КоманднаяПанельФормыБыстрыеОтборы(Элемент)
	ФормированиеОтчетов.УправлениеОтображениемЭлементовФормы(ЭтаФорма,Элемент);
КонецПроцедуры

Процедура КнопкаПериодаНажатие(Элемент)
	ФормированиеОтчетов.КнопкаПериодНажатие(ЭтотОбъект);
КонецПроцедуры

Процедура КнопкаСменыНажатие(Элемент)
	ФормированиеОтчетов.КнопкаСменаНажатие(ЭтотОбъект);
КонецПроцедуры

// Обработчик восстановления настройки отчета
//
Процедура ДействияФормыВосстановитьНастройки(Кнопка)
	
	ФормированиеОтчетов.ВосстановитьНастройкуОбр(ИмяОбъекта,  ЭтаФорма, Неопределено);
	
КонецПроцедуры

// Обработчик сохранения настройки отчета
//
Процедура ДействияФормыСохранитьНастройки(Кнопка)
	
	ФормированиеОтчетов.СохранитьНастройкуОтчета(ЭтотОбъект, ИмяОбъекта);
	
КонецПроцедуры

// Процедура назначается динамически
// Процедура вызывается при выборе пункта меню СписокКлиентов командной панели
// формы. Процедура отрабатывает сохранение списка клиентов.
// Подключение данной процедуры-обработчика выполняется из кода конфигурации
//
Процедура ДействияФормыСписокКлиентов(Кнопка)
	
	//Рассылки.СохранитьСписокСотрудниковВБуфер(ОтчетОбъект.ИнформацияРасшифровки, глСписокКлиентов)
	
КонецПроцедуры

ИмяОбъекта = "Отчет."+  ЭтотОбъект.Метаданные().Имя+"_"	;
НастройкиПереданы = Ложь;
